Autodesk.Revit.DB.LayerModifier.ModifierType
The modifier type of LayerModifier.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.LayerModifier.Separator
The separator string that will follow this modifier in the export layer name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.LayerModifier.#ctor(Autodesk.Revit.DB.ModifierType,System.String)
Constructs a new LayerModifier with modifierType and separator.
modifierType:
The modifier type.
separator:
The separator string that will follow this modifier in the export layer name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided separator contains invalid characters (most special characters are invalid).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014